{
  "contactMeDescription.text": "If, after getting acquainted with my activities, you still have any questions or would like to cooperate with me, then you can fill out the form on the right side and send me a message!",
  "contactMeHeader.text": "Drop Me A Message",
  "contactMeLocation.text": "Cracow, Poland",
  "header.text": "For more than three years I have been creating various game and business projects on Unity, but the beginning of my journey in IT lies in web design. Even at school, I loved to take part in various olympiads, created websites with the help of different website constructors, and now I would like to return to the roots, turning my old hobby into my main activity and start writing a new chapter in my professional career dedicated to web development!",
  "headerGreetings.text": "Welcome!",
  "loginButton.text": "Log In",
  "loginInputPlaceholder.text": "Your Email Address",
  "AboutNavbarElement.text": "About",
  "ExperienceNavbarElement.text": "Experience",
  "SkillsNavbarElement.text": "Skills",
  "ProjectsNavbarElement.text": "Projects",
  "ContactNavbarElement.text": "Contact",
  "dg1Responsibility.text": "Developing gameplay mechanics",
  "dg2Responsibility.text": "Level blockout",
  "dg3Responsibility.text": "Level design testing",
  "dg4Responsibility.text": "Designing and developing game economy",
  "dg5Responsibility.text": "Designing gameplay mechanics",
  "dg6Responsibility.text": "Gameplay mechanics balance",
  "jg1Responsibility.text": "Development and maintenance of the project architecture",
  "jg2Responsibility.text": "Providing team meetings",
  "jg3Responsibility.text": "Creating end goals for team",
  "jg4Responsibility.text": "Cooperation with partners in the implementation of external software in the project",
  "jg5Responsibility.text": "Project testing at the exhibition venue",
  "jg6Responsibility.text": "Checking the quality of development, holding retrospective meetings",
  "jg7Responsibility.text": "Developing business application for exhibition by National Bank order",
  "jg8Responsibility.text": "Designing and creating game's prototype",
  "jg9Responsibility.text": "Developing interactive project for museum exhibition",
   "pg1Responsibility.text": "Designing and programming the architecture of games",
  "pg2Responsibility.text": "Designing and programming core mechanics",
  "pg3Responsibility.text": "Programming UI behaviours and animations",
  "pg4Responsibility.text": "Designing and creating visual style of game (logo, wallpapers, graphics for the Steam)",
  "pg5Responsibility.text": "Coordinating level blockouts",
  "pg6Responsibility.text": "Designing and creating of game worlds",
  "pg7Responsibility.text": "Designing and creating trailer",
  "pg8Responsibility.text": "Game optimization",
  "pg9Responsibility.text": "Scene's lighting design",
  "pg10Responsibility.text": "Designing and creating cinematic gameplay",
  "contactBlockTitle.text": "CONTACT ME",
  "skillsBlockTitle.text": "SKILLS",
  "projectsBlockTitle.text": "PROJECTS",
  "experienceBlockTitle.text": "EXPERIENCE",
  "ts.text": "I currently work for DeGenerals S.A. over the Tank Squad project. My main responsibilities include designing levels and inventing various game mechanics. In addition to my duties as a level designer, my responsibilities also include some programming tasks. In general, the game consists in the passage of a tank campaign during the Second World War.",
  "rb.text": "I worked on a big interactive project which consists almost of 90 small applications dedicated to the human organism and medicine.",
  "cf.text": "Castle Flipper is a unique chance to become a medieval royal craftsman. Build your own Kingdom and re-arrange the castle, at your own discretion. I was developing the project architecture, programmed game mechanics. Also I have worked on level, game designs and trailer.",
  "al.text": "Providing pre-production stage of the project as a lead level designer. During this stage, my responsibilities were: game design, levels block-out, scenes lighting, animations, trailer production.",
  "gm.text": "A game prototype where a player can see the mafia's wife's daily routine at home, meanwhile her husband is doing something strange, scary, and unknown things for her. It was a 2D game with the part of card gameplay elements.Designed and developed a game prototype on the order by the Ministry of Culture and National Heritage.",
  "nbp.text": "Developed an application for the Polish National Bank dedicated to Jan Paweł II's anniversary, which was presented in the National polish museum of money.",
  "CurrentLanguage.text": "English",
  "EnglishLanguage.text": "English",
  "PolishLanguage.text": "Polish",
  "UkrainianLanguage.text": "Ukrainian",
  "GreetingsNavbar.text": "Hello, "
}
